print("Hello World")
print('Hello World')
print('철수가 인사한다. "안녕?"')
print("철수가 인사한다. \"안녕?\"")
print('나의 \'첫 코딩\' 입니다')
print("나의 '첫 코딩' 입니다")
print("오늘은 , 일요일")
print("오늘은", "일요일")
a = 1
print(a)
a = 123
print(a)
a = 15614454651326541564894163245641567465416574654798654897456465125641567416547514654894
print(a)
a = 1.2
print(a)
a = -3
print(a)
a = 0o177
print(a)
a = 46546541657897485456561316857497987641561456456415631564789748945648974894564657897465456451453465499999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999
b = 13164165478964165465498479564165415649874896641657465156456749864894894456945645645674987485749845641651521328948947859456465
print(a+b)
print(a-b)
print(a*b)
print(a/b)
a = 1165416541654654685999999999999999999999999999999999999999
b = 9
print(a ** b)
a = 10000000
b = 3
print(a % b)
a = 7
b = 4
print(a / b)
a = 80
b = 75
c = 65
d = a + b + c
print("평균점수 :", d/3)
a = 89
b = 3
print(a // b)
print(a % b)
print(23 % 2) # 1
print("안녕하세요. 오늘의 날씨는 화창합니다")
print('지나가던 한 사람이 물었다. "실례합니다. 여의도역으로 가는길이 어디입니까?" 질문 받은 사람이 대답했다. \" I don\'t know."')
print('\   /\\')
print(' ) ( \')')
print('(  / )')
print(' \(_)\\')
A = 14
B = 3
print(A+B)
print(A-B)
print(A*B)
print(A/B)
print(A%B)
