list = ['안녕', '친구들', '만나서', '반가워']
print(list[3])
list = [1, 5, 3, 6]
print(list[2:4])
list = [5]
print(list[:1])
list = [1, 5, 3, 6]
length = len(list)
print(length)
list = []
print(list)
과목 = ['국어', '수학', '영어', '과학']
print(과목)
무지개 = ['빨', '주', '노', '초', '파', '남', '보']
첫번째색 = 무지개[0]
print('무지개의 첫번째 색은 {}이다'.format(첫번째색))
무지개 = ['빨', '주', '노', '초', '파', '남', '보']
마지막색 = 무지개[6]
print('무지개의 마지막 색은 {}이다'.format(마지막색))
list1 = [1, 2, 3]
list2 = [4, 5, 6]
list3 = list1 + list2
print(list3)
동물 = ['개', '고양이']
식물 = ['소나무', '단풍나무']
생물 = 동물 + 식물
print(생물*3)
list = [1, 2, 3]
list[1] = 10
print(list)
동물  = ['강아지', '고양이', '새', '코끼리', '곰']
동물.append('사람')
print(동물)
동물 = ['강아지', '고양이', '새', '코끼리', '곰']
동물.insert(3, '돼지')
print(동물)
동물 = ['강아지', '고양이', '새', '코끼리', '곰']
del 동물[1]
print(동물)
동물 = ['강아지', '고양이', '새', '코끼리', '곰']
동물.remove('고양이')
print(동물)
tuple = ()
print(tuple)
음식 = ('떡볶이', '햄버거')
print(음식)
무지개 = ('빨', '주', '노', '초', '파', '남', '보')
첫번째색 = 무지개[0]
print('무지개의 첫번째 색은 {}이다'.format(첫번째색))
무지개 = ('빨', '주', '노', '초', '파', '남', '보')
마지막색 = 무지개[6]
print('무지개의 마지막 색은 {}이다'.format(마지막색))
t = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
print(t * 10)
t = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
t2 = t * 10
print(len(t2))
영화 = ['아바타', '어벤져스', '타이타닉', '명량', '겨울왕국']
print(영화)
영화 = ['아바타', '어벤져스', '타이타닉', '명량', '겨울왕국']
영화.append('겨울왕국2')
print(영화)
영화 = ['아바타', '어벤져스', '타이타닉', '명량', '겨울왕국2']
영화.insert(4, '겨울왕국')
print(영화)
영화 = ['아바타', '어벤져스', '타이타닉', '명량', '겨울왕국2']
del 영화[1]
print(영화)
영화 = ['아바타', '어벤져스', '타이타닉', '명량', '겨울왕국2']
영화.remove("어벤져스")
print(영화)
lang1 = ["C", "C++", "JAVA"]
lang2 = ["Python", "Go", "C#"]
langs = lang1 + lang2
print(langs)
tuple = ()
print(tuple)
data = int(input("1, 2, 3을 입력 : "))
t = ("주먹", "가위", "보")
print(t[data-1])
t = ('주먹', '가위', '보')
while True:
    data = int(input("1, 2, 3을 입력해주세요.")
    if data == -1:
        break
print(t[data-1])
