dic = {}
print(dic)
dic = {'이름':'김평립', '나이':13, '성별':'남', '생일':'12월 15일'}
print(dic)
ice = {"메로나":1000, "비비빅":1200, "빵빠레":1800}
print(ice)
ice = {"메로나":1000, "비비빅":1200, "빵빠레":1800}
ice['죠스바'] = 1200
ice['월드콘'] = 1500
print(ice)
ice = {"메로나":1000, "비비빅":1200, "빵빠레":1800, '죠스바':1200, '월드콘':1500}
print('메로나 가격: ', ice["메로나"])
ice = {"메로나":1000, "비비빅":1200, "빵빠레":1800, '죠스바':1200, '월드콘':1500}
ice["메로나"] = 1300
print(ice)
ice = {"메로나":1000, "비비빅":1200, "빵빠레":1800, '죠스바':1200, '월드콘':1500}
del ice["메로나"]
print(ice)
ice = {"메로나": [1000, 20],
    "비비빅": [1200, 3],
    "죠스바": [1800, 100]}
print(ice)
ice = {"메로나": [1000, 20],
    "비비빅": [1200, 3],
    "죠스바": [1800, 100]}
print(ice["메로나"][0], "원")
print(ice["메로나"][1], "개")
ice = {"메로나": [1000, 20],
    "비비빅": [1200, 3],
    "죠스바": [1800, 100]}
ice["월드콘"] = [500, 7]
print(ice)
days = {'1월' : 31, '2월' : 28, '3월' : 31}
print(days)
days = {'1월' : 31, '2월' : 28, '3월' : 31}
days["2월"] = 29
print(days)
days = {'1월' : 31, '2월' : 28, '3월' : 31}
days['13월'] = 30
del days['13월']
# data = input("숫자 입력 : ")
# print(data)
# 한글변환 = {'1':'일', '2':'이'}
# print(한글변환[data])
def 한글변환함수(num):
    한글변환 = {}
data = input("숫자 입력 : ")
한글변환함수(data)
A = set([2, 1, 3, 5, 7, 10, 100, 283])
B = set([3, 4, 1, 6, 22, 100, 302])
print(A & B)
print(A | B)
print(A - B)
print(B - A)
